nerya21/PS2-BLE-Keyboard/hid_emu_kbd_cc2650em_app/Drivers/RF/RF.c
/*
* Copyright (c) 2015-2016, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions
* are met:
*
* *  Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
* *  Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
* *  Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
* PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
* CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
* EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
* OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
* WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
* OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/sysbios/knl/Swi.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>
#include <inc/hw_memmap.h>
#include <inc/hw_ints.h>
#include <inc/hw_types.h>
#include <inc/hw_rfc_rat.h>
#include <inc/hw_rfc_dbell.h>
#include <driverlib/rfc.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/ioc.h>
#include <driverlib/aon_ioc.h>
#include <driverlib/rf_mailbox.h>
#include <driverlib/adi.h>
#include <driverlib/aon_rtc.h>
#include <ti/drivers/rf/RF.h>
#include <driverlib/chipinfo.h>
#include <xdc/runtime/Assert.h>

#if defined(__IAR_SYSTEMS_ICC__)
#pragma diag_remark=Pa082
#endif

/*-------------- Typedefs, structures & defines ---------------*/
typedef enum {
    Fsm_EventBootDone           = (1<<30),
    Fsm_EventPowerStep          = (1<<29),
    Fsm_EventLastCommandDone    = (1<<1),
    Fsm_EventWakeup             = (1<<2),
    Fsm_EventPowerDown          = (1<<3),
    Fsm_EventChangePhy          = (1<<12),
    Fsm_EventHwInt              = (1<<13),
    Fsm_EventCpeInt             = (1<<14)
} Fsm_Event;

#define N_MAX_CLIENTS               1      // Max # of RF driver clients
#define N_CMD_POOL                  8      // 8 RF_Cmds in pool
#define N_CMD_MODMASK               0xFFF  // Modulus mask used for RF_CmdHandle calculations

// Macros
#define ABS(x) (((x) < 0) ? -(x) : (x))

// Internal RF constants
#define RF_CMD0                                0x0607
#define RF_INTERNAL_IFG_MASK                   0xFFFFFFDF6000100E
#define RF_CMD_ABORTED_FLAG                    (1 << 0)
#define RF_CMD_STOPPED_FLAG                    (1 << 1)
#define RF_CMD_CANCELLED_FLAG                  (1 << 2)
#define RF_RUN_CMD_ON_RESTART_FLAG             (1 << 0)
#define RF_RAT_ERR_CB_EVENT_FLAG               (1 << 1)
#define RF_RAT_RPT_CPT_FLAG                    (1 << 2)
#define RF_HW_INT_RAT_CH_MASK                  (RFC_DBELL_RFHWIFG_RATCH7 | RFC_DBELL_RFHWIFG_RATCH6 | RFC_DBELL_RFHWIFG_RATCH5)
#define RF_MAX_RAT_CH_CNT                      3
#define RF_INTERNAL_HW_IFG_MASK_32_BIT         RFC_DBELL_RFHWIFG_MDMSOFT
#define RF_DEFAULT_POWER_UP_TIME               2500
#define RF_DEFAULT_POWER_DOWN_TIME             1000
#define RF_DEFAULT_POWER_UP_MARGIN             (250+32)
#define RF_MAX_CHAIN_CMD_LEN                   32
#define RF_RAT_CH_5_INDEX                      0x0
#define RF_RAT_CH_6_INDEX                      0x1
#define RF_RAT_CH_7_INDEX                      0x2
#define RF_RAT_CH_OFFSET                       5
#define RF_SEND_RAT_STOP_RATIO                 7
#define RF_RTC_CONV_TO_US_SHIFT                12
#define RF_DISPATCH_WRAP_AROUND_TIME_POS       (268435455)
#define RF_DISPATCH_WRAP_AROUND_TIME_NEG       (-268435456)
#define RF_DISPATCH_WRAP_AROUND_TIME_OFFSET    (536870902)
#define RF_SHIFT_32_BITS                       32
#define RF_SHIFT_8_BITS                        8
#define RF_SHIFT_16_BITS                       16
#define RF_RTC_TICK_INC                        (0x100000000LL/32768)
#define RF_SCALE_RTC_TO_4MHZ                   4000000
#define RF_NUM_RAT_TICKS_IN_1_US               4
#define RF_INTERNAL_CPE_IFG_MASK_32_BIT        0xFFFFFFFF
#define RF_XOSC_HF_SWITCH_CHECK_PERIOD         50
#define RF_DEFAULT_AVAILRATCH_VAL              0xFFFF
#define RF_ABORT_CANCEL_MULTIPLE_CMD           0x2
#define RF_ABORT_CANCEL_SINGLE_CMD             0x1
#define RF_CMDSTA_REG_VAL_MASK                 0xFF
#define RF_RAT_CPT_CONFIG_RATCH_MASK           0x0F00
#define RF_RAT_CPT_CONFIG_REP_MASK             0x1000

// RF command queue member
typedef struct RF_Cmd_s RF_Cmd;

// RF command member
struct RF_Cmd_s {
    RF_Cmd* volatile     pNext;   // Pointer to next #RF_Cmd in queue
    RF_Callback volatile pCb;     // Pointer to callback function
    RF_Op*               pOp;     // Pointer to (chain of) RF operations(s)
    RF_Object*           pClient; // Pointer to client
    RF_CmdHandle         ch;      // Command handle
    RF_Priority          ePri;    // Priority of RF command
    RF_EventMask         bmEvent; // Enable mask for interrupts from the command
    uint32_t             rfifg;   // Return value for callback 0:31 - RF_CPE0_INT, 32:63 - RF_HW_INT
    uint8_t volatile     flags;   // [0: Aborted, 1: Stopped, 2: cancelled]
};

// RF Direct Immediate command
typedef struct RF_CmdDirImm_s RF_CmdDirImm;

// RF direct immediate command member
struct RF_CmdDirImm_s {
    uint32_t             pOp;                       // Pointer to the Direct, Imm command
    RF_Handle            pClient;                   // Pointer to current client
    RF_Callback          pRatCb[RF_MAX_RAT_CH_CNT]; // Array of callback pointers for each RAT chan
    RF_Callback          pWakeUpErrCb;              // Pointer to wakeup callback in case of error
    uint16_t             availRatCh;                // bit-map for available RAT channels
    uint32_t             hwIntEvent;                // RF_HW events received
    uint8_t              rptCptRatChNum;            // Channel allocated for repeat mode
    uint8_t              flags;                     // [0:runOnRestart, 1:errEventCb, 2: rptCptFlag]
};

static RF_CmdDirImm cmdDirImm;
static bool bRatActive = false;

// FSM typedefs
typedef void (*Fsm_StateFxn)(RF_Object*, Fsm_Event const);

/*-------------- Forward declarations ---------------*/

// Common inactivity timeout clock callback
static void clkInactivityFxn(RF_Object* pObj);

// FSM helper functions
static void FsmDispatch(RF_Object* pObj, Fsm_Event const e);
static void FsmNextState(Fsm_StateFxn pTarget);

// FSM state functions
static void fsmPowerUpState(RF_Object *pObj, Fsm_Event e);
static void fsmPatchState(RF_Object *pObj, Fsm_Event e);
static void fsmSetupState(RF_Object *pObj, Fsm_Event e);
static void fsmActiveState(RF_Object *pObj, Fsm_Event e);
static void fsmPowerDownState(RF_Object *pObj, Fsm_Event e);
static void fsmXOSCState(RF_Object *pObj, Fsm_Event e);

// RF direct and immediate command implementation
static RF_Stat  postDirImmCmd(uint32_t pCmd, bool bStartRadio);

/*-------------- Constants ---------------*/

