nerya21/PS2-BLE-Keyboard/hid_emu_kbd_cc2650em_app/Drivers/RF/RF.c
    if ((e & RF_EventLastCmdDone) || (e & h->state.eventSync))
    {
        h->state.unpendCause = e;
        Semaphore_post(Semaphore_handle(&h->state.semSync));
    }
}


/*-------------- RF powerup/powerdown FSM functions ---------------*/

// Affect FSM state change
static void FsmDispatch(RF_Object* pObj, Fsm_Event const e)
{
    pFsmState(pObj, e);
}


// Set target state to transition to
static void FsmNextState(Fsm_StateFxn pTarget)
{
    pFsmState = pTarget;
}


// The SWI handler for FSM events
static void swiFxnFsm(UArg a0, UArg a1)
{
    FsmDispatch(pCurrClient, (Fsm_Event)Swi_getTrigger());
}


/* Clock callback called upon powerup */
static void clkPowerUpFxn(xdc_UArg a)
{
    // Start time measurements
    nRtc1  = AONRTCCurrent64BitValueGet();

    // Trigger FSM SWI to get radio wakeup going
    Swi_or(Swi_handle(&swiFsm), Fsm_EventWakeup);
}


// The CPE0 ISR during FSM powerup/powerdown
static void hwiFxnCpe0PowerFsm(UArg a0)
{
    // Clear all IRQ flags in doorbell and then clear them
    uint32_t rfcpeifg = RFCCpeIntGetAndClear();

    if ((rfcpeifg & IRQ_BOOT_DONE) || (rfcpeifg & IRQ_LAST_COMMAND_DONE))
    {
        Swi_or(Swi_handle(&swiFsm), Fsm_EventPowerStep);
    }
}



/*-------------- Power management state functions ---------------*/

static void fsmPowerUpState(RF_Object *pObj, Fsm_Event e)
{
    // Note: pObj is NULL in this state
    if (e!=Fsm_EventWakeup)
    {
        return;
    }

    // Set current client from first command in command queue
    RF_Cmd* pNextCmd;
    RF_CmdDirImm* pCmdDirImm = &cmdDirImm;
    if (pNextCmd = Q_peek(&cmdQ.pPend))
    {
        pCurrClient = pNextCmd->pClient;
    }
    else if (pCmdDirImm->flags & RF_RUN_CMD_ON_RESTART_FLAG)
    {
        pCurrClient = pCmdDirImm->pClient;
    }

    // Keep track of mode
    HWREG(PRCM_BASE + PRCM_O_RFCMODESEL) = pCurrClient->clientConfig.pRfMode->rfMode;
    if (HWREG(PRCM_BASE + PRCM_O_RFCMODESEL) != pCurrClient->clientConfig.pRfMode->rfMode)
    {
        // Unsupported mode
        while(1);
    }

    // Register power dependency and constraints - i.e. power up RF.
    Power_setConstraint(PowerCC26XX_SB_DISALLOW);
    Power_setDependency(PowerCC26XX_DOMAIN_RFCORE);

    // Start power-up sequence
    bPowerUpActive = true;

    if((pCurrClient->clientConfig.bPowerUpXOSC == false) || bStart == 0)
    {
        Power_setDependency(PowerCC26XX_XOSC_HF);
    }

    // Turn on additional clocks on boot
    if ((pCurrClient->clientConfig.pRfMode->mcePatchFxn != 0) || (pCurrClient->clientConfig.pRfMode->rfePatchFxn != 0))
    {
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = CMDR_DIR_CMD_2BYTE(RF_CMD0, RFC_PWR_PWMCLKEN_MDMRAM | RFC_PWR_PWMCLKEN_RFERAM);
    }

    // Turn on clock to RF core
    RFCClockEnable();

    // Map all radio interrupts to CPE0 and enable some sources
    HWREG(RFC_DBELL_BASE+RFC_DBELL_O_RFCPEISL) = 0;

    HWREG(RFC_DBELL_BASE+RFC_DBELL_O_RFCPEIEN) =
            RFC_DBELL_RFCPEIEN_LAST_COMMAND_DONE_M |
            RFC_DBELL_RFCPEIEN_BOOT_DONE_M;

    // Next FSM state
    FsmNextState(&fsmPatchState);

    // Enable interrupts and let BOOT_DONE interrupt kick things off
    Hwi_enableInterrupt(INT_RFC_CPE_0);
}


static void fsmPatchState(RF_Object *pObj, Fsm_Event e)
{
    if (e & Fsm_EventPowerStep)
    {
        // Patch CPE if relevant
        if (pObj->clientConfig.pRfMode->cpePatchFxn)
        {
            pObj->clientConfig.pRfMode->cpePatchFxn();
        }

        if ((pObj->clientConfig.pRfMode->mcePatchFxn != 0) || (pObj->clientConfig.pRfMode->rfePatchFxn != 0))
        {
            // Wait for clocks to turn on
            while(!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;

            // Patch if relevant
            if (pObj->clientConfig.pRfMode->mcePatchFxn)
            {
                pObj->clientConfig.pRfMode->mcePatchFxn();
            }

            // Patch if relevant
            if (pObj->clientConfig.pRfMode->rfePatchFxn)
            {
                pObj->clientConfig.pRfMode->rfePatchFxn();
            }

            // Turn off additional clocks
            RFCDoorbellSendTo(CMDR_DIR_CMD_2BYTE(RF_CMD0, 0));
        }

        // Next state: fsmSetupState
        FsmNextState(&fsmSetupState);
        Swi_or(Swi_handle(&swiFsm), Fsm_EventPowerStep);
    }
}


static void fsmSetupState(RF_Object *pObj, Fsm_Event e)
{
    if (e & Fsm_EventPowerStep)
    {
        //Initialize bus request
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = CMDR_DIR_CMD_1BYTE(CMD_BUS_REQUEST, 1);

        if (isCC13xx)
        {
            applyExtraAdi3VcoLdoVoltageModeOverrideCC13xx(true);
        }

        // Next state: fsmActiveState
        FsmNextState(&fsmActiveState);

        // Setup RAT_SYNC command to follow SETUP command
        opRatSync.start.commandNo                = CMD_SYNC_START_RAT;
        opRatSync.start.status                   = IDLE;
        opRatSync.start.startTrigger.triggerType = TRIG_NOW;
        opRatSync.start.pNextOp                  = NULL;
        opRatSync.start.condition.rule           = COND_NEVER;    // Default: don't chain

        // Setup SETUP command
        RF_RadioSetup* pOpSetup         = pObj->clientConfig.pOpSetup;
        pOpSetup->prop.status           = IDLE;
        RF_Op* tmp                      = (RF_Op*)&pOpSetup->prop;
        while ((tmp->pNextOp) && (tmp->pNextOp->commandNo != CMD_SYNC_START_RAT))
        {
            tmp = tmp->pNextOp;
        }
        tmp->pNextOp                    = (RF_Op*)&opRatSync.start;
        tmp->condition.rule             = COND_ALWAYS;

        // Setup FS command to follow SETUP command
        rfc_CMD_FS_t* pOpFs;
        RF_Op* pOpFirstPend = Q_peek(&cmdQ.pPend)->pOp;
        if ((pOpFirstPend->commandNo == CMD_FS) || (pOpFirstPend->commandNo == CMD_FS_OFF))
        {
            // First command is FS command so no need to chain an implicit FS command
            nRtc1 = 0;
        }
        else
        {
            if (pObj->state.mode_state.cmdFs.commandNo)
            {
                // Chain in the implicit FS command
                pOpFs                           = &pObj->state.mode_state.cmdFs;
                pOpFs->status                   = IDLE;
                pOpFs->pNextOp                  = NULL;
                pOpFs->startTrigger.triggerType = TRIG_NOW;
                pOpFs->condition.rule           = COND_NEVER;
                opRatSync.start.pNextOp         = (RF_Op*)pOpFs;
                opRatSync.start.condition.rule  = COND_ALWAYS;
            }
        }

        // Set RF Trim values
        rfTrim_t rfTrim;
        RFCRfTrimRead((rfc_radioOp_t*)pObj->clientConfig.pOpSetup, (rfTrim_t*)&rfTrim);
        RFCRfTrimSet((rfTrim_t*)&rfTrim);

        // Check Override RTrim vs FCFG RTrim
        RFCRTrim((rfc_radioOp_t*)pObj->clientConfig.pOpSetup);

        // Make sure BUS_REQUEST is done
        while(!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;

        // Split setup chain if XOSC_HF not ready
        if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF)
        {
            tmp->condition.rule = COND_NEVER;
            FsmNextState(&fsmXOSCState);
        }

        // Send chain
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = (uint32_t)&pObj->clientConfig.pOpSetup->commandId;
    }
}

static void fsmXOSCState(RF_Object *pObj, Fsm_Event e)
{
    if(OSCClockSourceGet(OSC_SRC_CLK_HF) == OSC_XOSC_HF)
    {
        FsmNextState(&fsmActiveState);

        // Do RAT sync
        HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = (uint32_t)&opRatSync.start;

        // Reset nRtc1
        nRtc1 = 0;
    }
    else
    {
        // Schedule next polling
        Clock_setTimeout(Clock_handle(&clkPowerUp), RF_XOSC_HF_SWITCH_CHECK_PERIOD/Clock_tickPeriod);
        Clock_start(Clock_handle(&clkPowerUp));
    }
}

static void fsmActiveState(RF_Object *pObj, Fsm_Event e)
{
    RF_Cmd* pCmd;
    RF_CmdDirImm* pCmdDirImm = &cmdDirImm;

    if (e & Fsm_EventCpeInt)
    {
        uint32_t key = Hwi_disable();
        pCmd = Q_peek(&cmdQ.pCurrCmdCb);
        uint32_t tmp = pCmd->rfifg;
        Hwi_restore(key);

        if (!(tmp & RF_EventLastCmdDone) && pCmd)
        {
            pCmd->rfifg &= (~tmp);
            if (pCmd->pCb)
            {
                pCmd->pCb(pCmd->pClient, pCmd->ch, (RF_EventMask)tmp);
            }
        }

        // We've handled this event now
        e &= ~Fsm_EventCpeInt;
    }
    else if (e & Fsm_EventLastCommandDone)
    {
        // Command done
        if (pCmd = Q_peek(&cmdQ.pDone))
        {
            // Update implicit radio state
            updateImplicitState(pCmd);

            uint32_t tmp = pCmd->rfifg;
            pCmd->rfifg = 0;
            // Call callback, free container and dequeue
            if (pCmd->pCb)
            {
                RF_EventMask cb_e = (RF_EventMask)(tmp | RF_EventLastCmdDone);
                switch (pCmd->flags)
                {
                    case RF_CMD_ABORTED_FLAG:
                        cb_e = RF_EventCmdAborted;
                        break;
                    case RF_CMD_STOPPED_FLAG:
                        cb_e = RF_EventCmdStopped;
                        break;
                    case RF_CMD_CANCELLED_FLAG:
                        cb_e = RF_EventCmdCancelled;
                        break;
                    default:
                        break;
                }
                pCmd->pCb(pCmd->pClient, pCmd->ch, cb_e);
            }

            cmdQ.nSeqDone = (cmdQ.nSeqDone+1)&N_CMD_MODMASK;
            Q_pop(&cmdQ.pDone);

            // Check if there are any more pending commands for this client
            if ((cmdQ.nSeqDone == pCmd->pClient->state.chLastPosted) && (!bRatActive))
            {
                // This was last posted command for client
                if (pCmd->pClient->state.bYielded || (pCmd->pClient->clientConfig.nInactivityTimeout == 0))
                {
                    // We can powerdown immediately
                    pCmd->pClient->state.bYielded = false;
                    decActiveClientCnt(0);
                }
                else
                {
                    if (pCurrClient->clientConfig.nInactivityTimeout != BIOS_WAIT_FOREVER)
                    {
                        // Start inactivity timer
                        Clock_setTimeout(Clock_handle(&pCmd->pClient->state.clkInactivity),
                                         pCmd->pClient->clientConfig.nInactivityTimeout/Clock_tickPeriod);
                        Clock_start(Clock_handle(&pCmd->pClient->state.clkInactivity));
                    }
                }
            }
        }
        // We've handled this event now
        e &= ~Fsm_EventLastCommandDone;
        if (pCmd = Q_peek(&cmdQ.pDone))
        {
            // Trigger self if there are more commands in callback queue
            e |= Fsm_EventLastCommandDone;
        }
    }
    else if (e & Fsm_EventPowerStep)
    {
        // Coming from powerup states

        // Change HWI handler
        Hwi_setFunc(Hwi_handle(&hwiCpe0), hwiFxnCpe0Active, (UArg)NULL);

        if(pObj->clientConfig.nPowerUpDuration == RF_DEFAULT_POWER_UP_TIME && OSCClockSourceGet(OSC_SRC_CLK_LF) != OSC_RCOSC_HF)
        {
            if (nRtc1 && (nRtc2 == 0))
            {
                nRtc2  = AONRTCCurrent64BitValueGet();
                if (nRtc2 > nRtc1)
                {
                    pObj->clientConfig.nPowerUpDuration = (nRtc2 - nRtc1) >> RF_RTC_CONV_TO_US_SHIFT;
                }
                else
                {
                    pObj->clientConfig.nPowerUpDuration = (0xFFFFFFFF + nRtc2 - nRtc1) >> RF_RTC_CONV_TO_US_SHIFT;
                }
                pObj->clientConfig.nPowerUpDuration += RF_DEFAULT_POWER_UP_MARGIN;
            }
        }

        // Get the available RAT channel map
        if (bInitAvailRatCh)
        {
            rfc_CMD_GET_FW_INFO_t getFwInfoCmd;
            getFwInfoCmd.commandNo = CMD_GET_FW_INFO;
            RFCDoorbellSendTo((uint32_t)&getFwInfoCmd);
            pCmdDirImm->availRatCh = getFwInfoCmd.availRatCh;
            bInitAvailRatCh = false;
        }

