nerya21/PS2-BLE-Keyboard/hid_emu_kbd_cc2650em_app/Drivers/RF/RF.c
    // Check whether command has finished, if not override command callback
    uint32_t key = Swi_disable();

    // Return immediately as command has already finished
    if ((cmdQ.nSeqPost - ch) < 0)
    {
        if((ch <= cmdQ.nSeqDone) || (cmdQ.nSeqPost >= cmdQ.nSeqDone))
        {
            Swi_restore(key);
            return RF_EventLastCmdDone;
        }
    }
    else
    {
        if ((ch <= cmdQ.nSeqDone) && (cmdQ.nSeqPost >= cmdQ.nSeqDone))
        {
            Swi_restore(key);
            return RF_EventLastCmdDone;
        }
    }

    RF_Cmd* pCmd = &aCmdPool[ch%N_CMD_POOL];

    // check if aborted
    if (pCmd->flags & (RF_CMD_ABORTED_FLAG | RF_CMD_STOPPED_FLAG | RF_CMD_CANCELLED_FLAG))
    {
        Swi_restore(key);
        while(pCmd->flags & (RF_CMD_ABORTED_FLAG | RF_CMD_STOPPED_FLAG | RF_CMD_CANCELLED_FLAG));
        return RF_EventLastCmdDone;
    }

    // Command has still not finished, override callback with one that posts to semaphore
    if (pCmd->pCb != syncCb)
    {
        h->state.pCbSync = (void*)pCmd->pCb;
        pCmd->pCb = syncCb;
    }

    h->state.eventSync = bmEvent;
    Swi_restore(key);

    // Wait for semaphore
    Semaphore_pend(Semaphore_handle(&h->state.semSync), BIOS_WAIT_FOREVER);

    // Return command event
    return h->state.unpendCause;
}


RF_EventMask RF_runCmd(RF_Handle h, RF_Op* pOp, RF_Priority ePri, RF_Callback pCb, RF_EventMask bmEvent)
{
    if (pCb == NULL)
    {
        pCb = syncCb;
    }

    RF_CmdHandle ch = RF_postCmd(h, pOp, ePri, pCb, bmEvent);

    if (ch<0)
    {
        return RF_EventCmdError;
    }
    return RF_pendCmd(h, ch, (RF_EventLastCmdDone | RF_EventCmdAborted | RF_EventCmdStopped | RF_EventCmdCancelled));
}


void RF_yield(RF_Handle h)
{
    //Assert
    Assert_isTrue((h != NULL), NULL);

    uint32_t key = Hwi_disable();

    bInitAvailRatCh = true;
    // Check for nSeqDone overflow
    if ((cmdQ.nSeqPost - h->state.chLastPosted) < 0)
    {
        if((h->state.chLastPosted <= cmdQ.nSeqDone) || (cmdQ.nSeqPost >= cmdQ.nSeqDone))
        {
            // All commands are done -> stop inactivity timer, decrement active
            // client count and potentially signal powerdown to FSM
            Clock_stop(Clock_handle(&h->state.clkInactivity));
            decActiveClientCnt(0);
            bYieldPwrDnCalled = true;
            Hwi_restore(key);
            return;
        }
    }
    else
    {
        if(h->state.chLastPosted == cmdQ.nSeqDone)
        {
            // All commands are done -> stop inactivity timer, decrement active
            // client count and potentially signal powerdown to FSM
            Clock_stop(Clock_handle(&h->state.clkInactivity));
            decActiveClientCnt(0);
            bYieldPwrDnCalled = true;
            Hwi_restore(key);
            return;
        }
    }

    // There are still client commands that haven't finished
    // -> set flag to indicate immediate powerdown when last command is done
    h->state.bYielded = true;
    bRatActive = false;
    Hwi_restore(key);
}

RF_Stat RF_cancelCmd(RF_Handle h, RF_CmdHandle ch, uint8_t mode)
{
    return abortCmd(h, ch, mode);
}

RF_Stat RF_flushCmd(RF_Handle h, RF_CmdHandle ch, uint8_t mode)
{
    return (abortCmd(h, ch, (mode | RF_ABORT_CANCEL_MULTIPLE_CMD)));
}

static RF_Stat abortCmd(RF_Handle h, RF_CmdHandle ch, uint8_t type)
{
      //Assert
    Assert_isTrue((h != NULL), NULL);

    // initialize local variables
    RF_Cmd* pCmdPend = Q_peek(&cmdQ.pPend);
    RF_CmdDirImm* pCmdDirImm = &cmdDirImm;
    bool bGraceful = type & RF_ABORT_CANCEL_SINGLE_CMD;
    bool bFlushing = false;
    RF_Stat status = RF_StatInvalidParamsError;

    // Check if current command
    uint32_t key = Hwi_disable();
    if (ch == RF_CMDHANDLE_FLUSH_ALL)
    {
        if (cmdQ.pCurrCmd)
        {
            ch = cmdQ.pCurrCmd->ch;
        }
        else
        {
            ch = cmdQ.nSeqDone + 1;
        }
        pCmdDirImm->flags = 0;
    }
    RF_Cmd* pCmd = &aCmdPool[ch%N_CMD_POOL];
    if (pCmd == cmdQ.pCurrCmd)
    {
        // Clear all pending commands
        if (type & RF_ABORT_CANCEL_MULTIPLE_CMD)
        {
            pCmdPend = cmdQ.pPend;
            cmdQ.pPend = NULL;
        }

        // Flag that operation has been aborted.
        pCmd->flags |= (1 << bGraceful);

        uint32_t keySwi = Swi_disable();

        RFCDoorbellSendTo((bGraceful) ? CMDR_DIR_CMD(CMD_STOP) : CMDR_DIR_CMD(CMD_ABORT));

        Hwi_restore(key);

        // Call callbacks
        if (type & RF_ABORT_CANCEL_MULTIPLE_CMD)
        {
            while (pCmdPend)
            {
                pCmdPend->flags |= RF_CMD_CANCELLED_FLAG;
                Q_push(&cmdQ.pDone, Q_pop(&pCmdPend));
            }
        }

        Swi_restore(keySwi);
        status = RF_StatSuccess;
    }
    else
    {
        if (pCmdPend == pCmd)
        {
            Clock_stop(Clock_handle(&clkPowerUp));
            if (type & RF_ABORT_CANCEL_MULTIPLE_CMD)
            {
                cmdQ.pPend = NULL;
            }
            else
            {
                cmdQ.pPend = cmdQ.pPend->pNext;
            }
            Hwi_restore(key);

            do {
                // Call callbacks
                pCmdPend->flags |= RF_CMD_CANCELLED_FLAG;
                Q_push(&cmdQ.pDone, Q_pop(&pCmdPend));
            } while ((pCmdPend) && (type & RF_ABORT_CANCEL_MULTIPLE_CMD));

            status = RF_StatSuccess;
        }
        else
        {
            while (pCmdPend)
            {
                if (pCmdPend->pNext == pCmd)
                {
                    Clock_stop(Clock_handle(&clkPowerUp));
                    RF_Cmd* pTemp = (RF_Cmd*)pCmdPend->pNext;
                    pCmdPend->pNext = NULL;
                    pCmdPend = pTemp;
                    Hwi_restore(key);
                    if (type & RF_ABORT_CANCEL_MULTIPLE_CMD)
                    {
                        bFlushing = true;
                    }
                    else
                    {
                        pCmdPend->flags |= RF_CMD_CANCELLED_FLAG;
                        Q_push(&cmdQ.pDone, Q_pop(&pCmdPend));
                    }
                    status = RF_StatSuccess;
                }
                if (bFlushing)
                {
                    pCmdPend->flags |= RF_CMD_CANCELLED_FLAG;
                    Q_push(&cmdQ.pDone, Q_pop(&pCmdPend));
                }
                else
                {
                    pCmdPend = (RF_Cmd*)pCmdPend->pNext;
                }
            }
            if (status != RF_StatSuccess)
            {
                Hwi_restore(key);
            }
        }

        if (bPowerUpActive)
        {
            Swi_or(Swi_handle(&swiFsm), Fsm_EventLastCommandDone);
        }
        else
        {
            FsmNextState(fsmActiveState);
            Swi_or(Swi_handle(&swiFsm), Fsm_EventLastCommandDone);

            if (!bRadioActive)
            {
                FsmNextState(fsmPowerUpState);
            }
        }
    }

    return(status);
}


void RF_Params_init(RF_Params *params)
{
    //Assert
    Assert_isTrue((params != NULL), NULL);

