nerya21/PS2-BLE-Keyboard/hid_emu_kbd_cc2650em_app/Drivers/RF/RF.c
    *params = RF_defaultParams;
}


static RF_Stat postDirImmCmd(uint32_t pCmdStruct, bool bStartRadio)
{
    uint32_t key = Hwi_disable();
    if (bRadioActive)
    {
        // run command now
        uint32_t cmdstaVal = RFCDoorbellSendTo(pCmdStruct);
        Hwi_restore(key);
        if ((cmdstaVal & RF_CMDSTA_REG_VAL_MASK) == CMDSTA_Done)
        {
            return RF_StatCmdDoneSuccess;
        }
        else
        {
            return RF_StatCmdDoneError;
        }
    }
    else
    {
        Hwi_restore(key);
        return RF_StatRadioInactiveError;
    }
}

RF_Stat RF_runImmediateCmd(RF_Handle h, uint32_t* pCmdStruct)
{
    //Assert
    Assert_isTrue((h != NULL), NULL);

    // Return Error case
    if (h != pCurrClient)
    {
        return RF_StatInvalidParamsError;
    }

    // run command
    return postDirImmCmd((uint32_t)pCmdStruct, false);
}

RF_Stat RF_runDirectCmd(RF_Handle h, uint32_t cmd)
{
    //Assert
    Assert_isTrue((h != NULL), NULL);

    // Return Error case
    if (h != pCurrClient)
    {
        return RF_StatInvalidParamsError;
    }

    // run command now
    return postDirImmCmd(cmd, false);
}

int8_t RF_getRssi(RF_Handle h)
{
    if ((h!= pCurrClient) || (!bRadioActive))
    {
        return RF_GET_RSSI_ERROR_VAL;
    }

    uint32_t key = Hwi_disable();
    uint32_t cmdsta = RFCDoorbellSendTo(CMDR_DIR_CMD(CMD_GET_RSSI));
    Hwi_restore(key);

    if ((cmdsta & RF_CMDSTA_REG_VAL_MASK) == CMDSTA_Done)
    {
        return (int8_t)((cmdsta >> RF_SHIFT_16_BITS) & RF_CMDSTA_REG_VAL_MASK);
    }
    else
    {
        return (int8_t)RF_GET_RSSI_ERROR_VAL;
    }
}

RF_Stat RF_getInfo(RF_Handle h, RF_InfoType type, RF_InfoVal *pValue)
{
    RF_Stat status = RF_StatSuccess;

    uint32_t key = Hwi_disable();
    switch(type)
    {
        case RF_GET_CURR_CMD:
            if (cmdQ.pCurrCmd)
            {
                pValue->ch = cmdQ.pCurrCmd->ch;
            }
            else
            {
                status = RF_StatError;
            }
            break;
        case RF_GET_AVAIL_RAT_CH:
            if (bInitAvailRatCh == false)
            {
                pValue->availRatCh = cmdDirImm.availRatCh;
            }
            else
            {
                status = RF_StatError;
            }
            break;
        case RF_GET_RADIO_STATE:
            pValue->bRadioState = bRadioActive;
            break;
        default:
            status = RF_StatInvalidParamsError;
            break;
    }
    Hwi_restore(key);

    return status;
}

RF_Op* RF_getCmdOp(RF_Handle h, RF_CmdHandle cmdHnd)
{
    return (aCmdPool[cmdHnd % N_CMD_POOL].pOp);
}

static int8_t ratChanAlloc(RF_CmdDirImm *pDirImmCmd)
{
    int8_t i;
    if (bInitAvailRatCh == false)
    {
        for (i=0; i<15; i++)
        {
            // Update free RAT chan bitmap and create HW Event for allocated channel
            if (pDirImmCmd->availRatCh & (1 << i))
            {
                pDirImmCmd->availRatCh &= ~(1<<i);
                HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIEN) |= (1<<(i+RFC_DBELL_RFHWIFG_RATCH0_BITN));
                return i;
            }
        }
    }

    return (int8_t)RF_ALLOC_ERROR;
}

static void ratChanFree(int8_t ratChannelNum)
{
    RF_CmdDirImm* pCmd = &cmdDirImm;

    uint32_t key = Hwi_disable();
    if (!((pCmd->flags & RF_RAT_RPT_CPT_FLAG) && (ratChannelNum == pCmd->rptCptRatChNum)))
    {
        pCmd->availRatCh |= (1 << ratChannelNum);
        HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIEN) &= ~(1 << (ratChannelNum + RFC_DBELL_RFHWIFG_RATCH0_BITN));
        if (!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIEN))
        {
            bRatActive = false;
        }
    }

    Hwi_restore(key);
}

int8_t RF_ratCompare(RF_Handle h, rfc_CMD_SET_RAT_CMP_t* pCmdStruct, \
                            uint32_t compareTime, RF_Callback pRatCb)
{
    if (h != pCurrClient)
    {
        return RF_StatInvalidParamsError;
    }

    RF_CmdDirImm* pDirImmCmd = &cmdDirImm;

    pCmdStruct->commandNo = CMD_SET_RAT_CMP;
    pCmdStruct->compareTime = compareTime;
    pDirImmCmd->pClient = h;
    pDirImmCmd->pOp = (uint32_t)pCmdStruct;

    int8_t ratCh = ratChanAlloc(pDirImmCmd);

    if (ratCh >= 0)
    {
        pCmdStruct->ratCh = ratCh;
        RF_Stat status = postDirImmCmd((uint32_t)pCmdStruct, false);
        if ((status == RF_StatCmdDoneError) || (status == RF_StatRadioInactiveError))
        {
            ratChanFree(ratCh);
            ratCh = RF_ALLOC_ERROR;
        }
        else
        {
            pDirImmCmd->pRatCb[ratCh - RF_RAT_CH_OFFSET] = pRatCb;
            bRatActive = true;
        }
    }

    return ratCh;
}

int8_t RF_ratCapture(RF_Handle h, uint16_t config, RF_Callback  pRatCb)
{
    if (h != pCurrClient)
    {
        return RF_StatInvalidParamsError;
    }

    RF_CmdDirImm* pDirImmCmd = &cmdDirImm;

    int8_t ratCh = ratChanAlloc(pDirImmCmd);

    if (ratCh >= 0)
    {
        uint32_t key = Hwi_disable();
        config |= (ratCh << RF_SHIFT_8_BITS) & RF_RAT_CPT_CONFIG_RATCH_MASK;
        pDirImmCmd->pOp = (uint32_t)CMDR_DIR_CMD_2BYTE(CMD_SET_RAT_CPT, config);
        uint32_t cmdstaVal = RFCDoorbellSendTo(pDirImmCmd->pOp);
        if ((cmdstaVal & RF_CMDSTA_REG_VAL_MASK) == CMDSTA_Done)
        {
            if (config & RF_RAT_CPT_CONFIG_REP_MASK)
            {
                HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIFG) &= ~(1 << (ratCh + RFC_DBELL_RFHWIFG_RATCH0_BITN));
                pDirImmCmd->rptCptRatChNum = ratCh;
                pDirImmCmd->flags |= RF_RAT_RPT_CPT_FLAG;
            }
            pDirImmCmd->pClient = h;
            pDirImmCmd->pRatCb[ratCh - RF_RAT_CH_OFFSET] = pRatCb;
            bRatActive = true;
        }
        else
        {
            ratChanFree(ratCh);
            ratCh = RF_ALLOC_ERROR;
        }
        Hwi_restore(key);
    }
    return ratCh;
}

RF_Stat RF_ratHwOutput(RF_Handle h, uint16_t config)
{
    if (h != pCurrClient)
    {
        return RF_StatInvalidParamsError;
    }
    // run command now
    return postDirImmCmd(((uint32_t)CMDR_DIR_CMD_2BYTE(CMD_SET_RAT_OUTPUT, config)), false);
}


RF_Stat RF_ratDisableChannel(RF_Handle h, int8_t ratChannelNum)
{
    if (h != pCurrClient)
    {
        return RF_StatInvalidParamsError;
    }

    RF_CmdDirImm* pCmd = &cmdDirImm;
    if ((pCmd->flags & RF_RAT_RPT_CPT_FLAG) && (ratChannelNum == pCmd->rptCptRatChNum))
    {
        pCmd->flags &= ~RF_RAT_RPT_CPT_FLAG;
        pCmd->rptCptRatChNum = 0;
    }
    uint32_t key = Hwi_disable();
    ratChanFree(ratChannelNum);
    uint32_t cmdStaVal = RFCDoorbellSendTo(CMDR_DIR_CMD_2BYTE(CMD_DISABLE_RAT_CH, (ratChannelNum << 8)));
    HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIFG) &= ~(1 << (ratChannelNum + RFC_DBELL_RFHWIFG_RATCH0_BITN));
    Hwi_restore(key);

    if ((cmdStaVal & RF_CMDSTA_REG_VAL_MASK) == CMDSTA_Done)
    {
        return RF_StatCmdDoneSuccess;
    }
    else
    {
        return RF_StatCmdDoneError;
    }
}
